backend/tests/load-test.yml
# Artillery Load Test Configuration
# Run with: artillery run tests/load-test.yml

config:
  target: "http://localhost:5001"
  phases:
    # Warm up phase
    - duration: 30
      arrivalRate: 5
      name: "Warm up"
    # Ramp up load
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: "Ramp up load"
    # Sustained load
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
    # Spike test
    - duration: 30
      arrivalRate: 100
      name: "Spike"
    # Cool down
    - duration: 30
      arrivalRate: 10
      name: "Cool down"
  
  variables:
    adminEmail: "admin@kayak.com"
    adminPassword: "Admin@123"
  
  payload:
    path: "tests/data/test-users.csv"
    skipHeader: true
    fields:
      - "userId"
      - "email"

  plugins:
    expect: {}

  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  # Authentication flow
  - name: "Admin Login"
    weight: 10
    flow:
      - post:
          url: "/api/admin/auth/login"
          json:
            email: "{{ adminEmail }}"
            password: "{{ adminPassword }}"
          capture:
            - json: "$.data.token"
              as: "authToken"
          expect:
            - statusCode: 200
            - hasProperty: "data.token"

  # Dashboard access
  - name: "Dashboard Stats"
    weight: 20
    flow:
      - post:
          url: "/api/admin/auth/login"
          json:
            email: "{{ adminEmail }}"
            password: "{{ adminPassword }}"
          capture:
            - json: "$.data.token"
              as: "authToken"
      - get:
          url: "/api/admin/users?page=1&limit=10"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
      - get:
          url: "/api/admin/billing/stats?year=2024"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

  # User management flow
  - name: "User Management"
    weight: 25
    flow:
      - post:
          url: "/api/admin/auth/login"
          json:
            email: "{{ adminEmail }}"
            password: "{{ adminPassword }}"
          capture:
            - json: "$.data.token"
              as: "authToken"
      - get:
          url: "/api/admin/users?page=1&limit=10"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
      - get:
          url: "/api/admin/users?page=2&limit=10"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
      - get:
          url: "/api/admin/users?page=3&limit=10"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

  # Billing queries
  - name: "Billing Queries"
    weight: 20
    flow:
      - post:
          url: "/api/admin/auth/login"
          json:
            email: "{{ adminEmail }}"
            password: "{{ adminPassword }}"
          capture:
            - json: "$.data.token"
              as: "authToken"
      - get:
          url: "/api/admin/billing?page=1&limit=10"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
      - get:
          url: "/api/admin/billing/search?startDate=2024-01-01&endDate=2024-12-31"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

  # Analytics queries
  - name: "Analytics Dashboard"
    weight: 25
    flow:
      - post:
          url: "/api/admin/auth/login"
          json:
            email: "{{ adminEmail }}"
            password: "{{ adminPassword }}"
          capture:
            - json: "$.data.token"
              as: "authToken"
      - get:
          url: "/api/admin/analytics/revenue/top-properties?year=2024"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
      - get:
          url: "/api/admin/analytics/revenue/by-city?year=2024"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
      - get:
          url: "/api/admin/analytics/providers/top-performers?year=2024"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

  # Health check (simple endpoint)
  - name: "Health Check"
    weight: 5
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200